bikerglen/homebrew_zigbee_devices/nrf52840-four-input/zigbee_switch_v2/src/main.c
//---------------------------------------------------------------------------------------------
// includes
//

#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/gpio.h>
#include <dk_buttons_and_leds.h>
#include <ram_pwrdn.h>

#include <drivers/include/nrfx_saadc.h>

#include <zboss_api.h>
#include <zboss_api_addons.h>
#include <zb_zcl_reporting.h>
#include <zigbee/zigbee_app_utils.h>
#include <zigbee/zigbee_error_handler.h>
#include <zb_nrf_platform.h>
#include "zb_mem_config_custom.h"
#include "zb_four_input.h"


//---------------------------------------------------------------------------------------------
// defines
//

// Uncomment to enable reports on release in addition to the standard reports on press
#define ENABLE_BUTTON_RELEASE_REPORTS

// Basic cluster attributes initial values. For more information, see section 3.2.2.2 of the ZCL specification.
#define FOUR_INPUT_INIT_BASIC_APP_VERSION       01                                  // Version of the application software (1 byte).
#define FOUR_INPUT_INIT_BASIC_STACK_VERSION     10                                  // Version of the implementation of the Zigbee stack (1 byte).
#define FOUR_INPUT_INIT_BASIC_HW_VERSION        11                                  // Version of the hardware of the device (1 byte).
#define FOUR_INPUT_INIT_BASIC_MANUF_NAME        "bikerglen.com"                     // Manufacturer name (32 bytes).
#define FOUR_INPUT_INIT_BASIC_MODEL_ID          "four-input"                        // Model number assigned by the manufacturer (32-bytes long string).
#define FOUR_INPUT_INIT_BASIC_DATE_CODE         "20240226"                          // Date provided by the manufacturer of the device in ISO 8601 format (YYYYMMDD), for the first 8 bytes. The remaining 8 bytes are manufacturer-specific.
#define FOUR_INPUT_INIT_BASIC_POWER_SOURCE      ZB_ZCL_BASIC_POWER_SOURCE_BATTERY   // Type of power source or sources available for the device. For possible values, see section 3.2.2.2.8 of the ZCL specification.
#define FOUR_INPUT_INIT_BASIC_LOCATION_DESC     "Earth"                             // Description of the physical location of the device (16 bytes). You can modify it during the commisioning process.
#define FOUR_INPUT_INIT_BASIC_PH_ENV            ZB_ZCL_BASIC_ENV_UNSPECIFIED        // Description of the type of physical environment. For possible values, see section 3.2.2.2.10 of the ZCL specification.

// source endpoint for our device
#define SOURCE_ENDPOINT            1

// destination short address and endpoint (always endpoint 1 on the coordinator)
#define DEST_SHORT_ADDR            0x0000
#define DEST_ENDPOINT              1

// Do not erase NVRAM to save the network parameters after device reboot or
// power-off. NOTE: If this option is set to ZB_TRUE then do full device erase
// for all network devices before running other samples.
#define ERASE_PERSISTENT_CONFIG    ZB_FALSE

// LEDs
#define ZIGBEE_NETWORK_STATE_LED   0      // on: disconnected, blinking: identify, off: normal operation
#define USER_LED                   1      // unused

// Buttons
#define BUTTON_0                   BIT(0) // off (0)
#define BUTTON_1                   BIT(1) // on (1)
#define BUTTON_2                   BIT(2) // toggle (2)
#define BUTTON_3                   BIT(3) // reserved (3)
#define BUTTON_4                   BIT(4) // short press: identify, long press: factory reset

// no idea but required for successful compile
#define bat_num

// read and report battery voltage after an initial delay after joining the network 
// then read and report battery voltage after the specified period elapses.
#define READ_BATTERY_VOLTAGE_INITIAL_DELAY K_SECONDS(10)
#define READ_BATTERY_VOLTAGE_TIMER_PERIOD  K_HOURS(8)


//---------------------------------------------------------------------------------------------
// typedefs
//

// attribute storage for battery power config
struct zb_zcl_power_attrs {
    zb_uint8_t voltage; // Attribute 3.3.2.2.3.1
    zb_uint8_t size; // Attribute 3.3.2.2.4.2
    zb_uint8_t quantity; // Attribute 3.3.2.2.4.4
    zb_uint8_t rated_voltage; // Attribute 3.3.2.2.4.5
    zb_uint8_t alarm_mask; // Attribute 3.3.2.2.4.6
    zb_uint8_t voltage_min_threshold; // Attribute 3.3.2.2.4.7
    zb_uint8_t percent_remaining; // Attribute 3.3.2.2.3.1
    zb_uint8_t voltage_threshold_1; // Attribute 3.3.2.2.4.8
    zb_uint8_t voltage_threshold_2; // Attribute 3.3.2.2.4.8
    zb_uint8_t voltage_threshold_3; // Attribute 3.3.2.2.4.8
    zb_uint8_t percent_min_threshold; // Attribute 3.3.2.2.4.9
    zb_uint8_t percent_threshold_1; // Attribute 3.3.2.2.4.10
    zb_uint8_t percent_threshold_2; // Attribute 3.3.2.2.4.10
    zb_uint8_t percent_threshold_3; // Attribute 3.3.2.2.4.10
    zb_uint32_t alarm_state; // Attribute 3.3.2.2.4.11
};

typedef struct zb_zcl_power_attrs zb_zcl_power_attrs_t;

// attribute storage for our device
struct zb_device_ctx {
	zb_zcl_basic_attrs_ext_t basic_attr;
	zb_zcl_identify_attrs_t identify_attr;
	zb_zcl_power_attrs_t power_attr;
};

// storage for the destination short address and endpoint number
struct dest_context {
	zb_uint8_t endpoint;
	zb_uint16_t short_addr;
};

// coin cell voltage-capacity pairs
typedef struct {
  uint16_t      voltage;
  uint8_t       capacity;
} voltage_capacity_pair_t;


//---------------------------------------------------------------------------------------------
// Prototypes
//

// used to display reporting info structures if needed
zb_zcl_reporting_info_t *zb_zcl_get_reporting_info(zb_uint8_t slot_number);

void zboss_signal_handler (zb_bufid_t bufid);
static void configure_gpio (void);
static void button_handler (uint32_t button_state, uint32_t has_changed);
static void light_switch_send_on_off (zb_bufid_t bufid, zb_uint16_t cmd_id);
static void start_identifying (zb_bufid_t bufid);
static void identify_cb (zb_bufid_t bufid);
static void toggle_identify_led (zb_bufid_t bufid);
static void app_clusters_attr_init (void);
static void configure_attribute_reporting (void);
static void read_battery_voltage_cb (struct k_timer *timer);
static void read_battery_voltage_work_handler(struct k_work *work);
static uint8_t cr2032_CalculateLevel (uint16_t voltage);
static void send_attribute_report (zb_bufid_t bufid, zb_uint16_t cmd_id);

#if DT_NODE_EXISTS(DT_NODELABEL(sw_spi_cs_n))
static void power_down_spi_flash (void);
#endif


//---------------------------------------------------------------------------------------------
// Globals
//

