bikerglen/homebrew_zigbee_devices/nrf52840-four-input/zigbee_switch_v2/src/main.c
#if !defined ZB_ED_ROLE
#error Define ZB_ED_ROLE to compile light switch (End Device) source code.
#endif

LOG_MODULE_REGISTER (app, LOG_LEVEL_INF);

// attribute storage for our device
static struct zb_device_ctx dev_ctx;

// storage for the destination short address and endpoint number
static struct dest_context dest_ctx;

// Declare attribute list for Basic cluster (server).
ZB_ZCL_DECLARE_BASIC_ATTRIB_LIST_EXT
(
	basic_server_attr_list,
	&dev_ctx.basic_attr.zcl_version,
	&dev_ctx.basic_attr.app_version,
	&dev_ctx.basic_attr.stack_version,
	&dev_ctx.basic_attr.hw_version,
	dev_ctx.basic_attr.mf_name,
	dev_ctx.basic_attr.model_id,
	dev_ctx.basic_attr.date_code,
	&dev_ctx.basic_attr.power_source,
	dev_ctx.basic_attr.location_id,
	&dev_ctx.basic_attr.ph_env,
	dev_ctx.basic_attr.sw_ver
);

// Declare attribute list for Identify cluster (client).
ZB_ZCL_DECLARE_IDENTIFY_CLIENT_ATTRIB_LIST
(
	identify_client_attr_list
);

// Declare attribute list for Identify cluster (server).
ZB_ZCL_DECLARE_IDENTIFY_SERVER_ATTRIB_LIST
(
	identify_server_attr_list,
	&dev_ctx.identify_attr.identify_time
);

// Declare attribute list for On/Off cluster (client).
ZB_ZCL_DECLARE_ON_OFF_CLIENT_ATTRIB_LIST
(
	on_off_client_attr_list
);

// Declare attribute list for power configuration cluster (server).
ZB_ZCL_DECLARE_POWER_CONFIG_BATTERY_ATTRIB_LIST_EXT(
	power_config_server_attr_list,
	&dev_ctx.power_attr.voltage,
	&dev_ctx.power_attr.size,
	&dev_ctx.power_attr.quantity,
	&dev_ctx.power_attr.rated_voltage,
	&dev_ctx.power_attr.alarm_mask,
	&dev_ctx.power_attr.voltage_min_threshold,
	&dev_ctx.power_attr.percent_remaining,
	&dev_ctx.power_attr.voltage_threshold_1,
	&dev_ctx.power_attr.voltage_threshold_2,
	&dev_ctx.power_attr.voltage_threshold_3,
	&dev_ctx.power_attr.percent_min_threshold,
	&dev_ctx.power_attr.percent_threshold_1,
	&dev_ctx.power_attr.percent_threshold_2,
	&dev_ctx.power_attr.percent_threshold_3,
	&dev_ctx.power_attr.alarm_state
);

// Declare cluster list for four input device.
ZB_DECLARE_FOUR_INPUT_CLUSTER_LIST
(
	four_input_clusters,
	basic_server_attr_list,
	identify_client_attr_list,
	identify_server_attr_list,
	on_off_client_attr_list,
	power_config_server_attr_list
);

// Declare endpoint for four input device.
ZB_DECLARE_FOUR_INPUT_EP
(
	four_input_ep,
	SOURCE_ENDPOINT,
	four_input_clusters
);

// Declare application's device context (list of registered endpoints) for four input device.
ZBOSS_DECLARE_DEVICE_CTX_1_EP
(
	four_input_ctx, 
	four_input_ep
);

// alarm for taking an ADC reading every 6 hours
struct k_timer read_battery_voltage_timer;
K_WORK_DEFINE (read_battery_voltage_work, read_battery_voltage_work_handler);

// Voltage - Capacity pair table from thunderboard react
// Algorithm assumes the values are arranged in a descending order.
// The values in the table are an average of those found in the CR2032 datasheets from
// Energizer, Maxell and Panasonic. Table modified for zigbee half percent steps.
static voltage_capacity_pair_t vcPairs[] =
{ { 3000, 200 }, { 2900, 160 }, { 2800, 120 }, { 2700, 80 }, { 2600, 60 },
  { 2500, 40 }, { 2400, 20 }, { 2000, 0 } };


//---------------------------------------------------------------------------------------------
// main
//

int main (void)
{
	LOG_INF ("Starting Four Input Device");

	// initialize
	configure_gpio ();
	register_factory_reset_button (BUTTON_4);
	zigbee_erase_persistent_storage (ERASE_PERSISTENT_CONFIG);
	zb_set_ed_timeout (ED_AGING_TIMEOUT_64MIN);
    zb_set_keepalive_timeout (ZB_MILLISECONDS_TO_BEACON_INTERVAL(3600*1000));
    
#if DT_NODE_EXISTS (DT_NODELABEL (sw_spi_cs_n))
	// place spi flash in power down mode
	power_down_spi_flash ();
#endif

	// send things to endpoint 1 on the coordinator
	dest_ctx.short_addr = DEST_SHORT_ADDR;
	dest_ctx.endpoint = DEST_ENDPOINT;

	// configure for lowest power
	zigbee_configure_sleepy_behavior (true);
	power_down_unused_ram ();

	// register switch device context (endpoints)
	ZB_AF_REGISTER_DEVICE_CTX (&four_input_ctx);

	// initialize application clusters
	app_clusters_attr_init ();

	// register handlers to identify notifications
	ZB_AF_SET_IDENTIFY_NOTIFICATION_HANDLER(SOURCE_ENDPOINT, identify_cb);

	// initialize read battery voltage timer
	k_timer_init (&read_battery_voltage_timer, read_battery_voltage_cb, NULL);

	// start Zigbee default thread
	zigbee_enable ();

	LOG_INF ("Four Input Device started");

	// suspend main thread
	while (1) {
		k_sleep (K_FOREVER);
	}
}


//---------------------------------------------------------------------------------------------
// zigbee stack event handler
//

void zboss_signal_handler(zb_bufid_t bufid)
{
	static bool lastJoin = false;

	zb_zdo_app_signal_hdr_t *sig_hndler = NULL;
	zb_zdo_app_signal_type_t sig = zb_get_app_signal(bufid, &sig_hndler);
	zb_ret_t status = ZB_GET_APP_SIGNAL_STATUS(bufid);

	// Update network status LED.
	// zigbee_led_status_update(bufid, ZIGBEE_NETWORK_STATE_LED);

	// Call default signal handler until there's a reason to check for different signals
	// the default handler evens calls zb_sleep_now for us
	ZB_ERROR_CHECK(zigbee_default_signal_handler(bufid));

	// free buffer if it's allocated
	if (bufid) {
		zb_buf_free(bufid);
	}

	// once joined, set the poll and battery voltage intervals to an hour.
	// if using a sparkfun board with a spi flash chip, drop the flash chip 
	// into power down mode again just in case missed it the first time.
	bool thisJoin = ZB_JOINED();
	if ((lastJoin == false) && (thisJoin == true)) {
		LOG_INF ("joined network!");
		dk_set_led_off (ZIGBEE_NETWORK_STATE_LED);
		zb_zdo_pim_set_long_poll_interval (3600*1000);
		configure_attribute_reporting ();
		status = zb_zcl_start_attr_reporting(SOURCE_ENDPOINT, ZB_ZCL_CLUSTER_ID_POWER_CONFIG, ZB_ZCL_CLUSTER_SERVER_ROLE, ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID);
		k_timer_start(&read_battery_voltage_timer, READ_BATTERY_VOLTAGE_INITIAL_DELAY, READ_BATTERY_VOLTAGE_TIMER_PERIOD);
#if DT_NODE_EXISTS(DT_NODELABEL(sw_spi_cs_n))
		power_down_spi_flash ();
#endif
	} else if ((lastJoin == true) && (thisJoin == false)) {
		LOG_INF ("left network!");
		// no longer joined, turn on network state led and stop reading battery voltage
		dk_set_led_on (ZIGBEE_NETWORK_STATE_LED);
		k_timer_stop(&read_battery_voltage_timer);
	}
	lastJoin = thisJoin;
}


//---------------------------------------------------------------------------------------------
// configure attribute reporting
//

#define RPT_MIN 0x0001
#define RPT_MAX 0xFFFE

