bikerglen/homebrew_zigbee_devices/nrf52840-four-input/zigbee_switch_v2/src/main.c
static void configure_attribute_reporting (void)
{
	// If the maximum reporting interval is set to 0xffff then the device shall not issue any 
	// reports for the attribute. If it is set to 0x0000 and minimum reporting interval is set 
	// to something other than 0xffff then the device shall not do periodic reporting.
	// It can still send reports on value change in the last case, but not periodic.

	zb_zcl_reporting_info_t batt_rep_info;
	zb_ret_t status;

	memset(&batt_rep_info, 0, sizeof(batt_rep_info));
	batt_rep_info.direction = ZB_ZCL_CONFIGURE_REPORTING_SEND_REPORT;
	batt_rep_info.ep = SOURCE_ENDPOINT;
	batt_rep_info.cluster_id = ZB_ZCL_CLUSTER_ID_POWER_CONFIG;
	batt_rep_info.cluster_role = ZB_ZCL_CLUSTER_SERVER_ROLE;
	batt_rep_info.attr_id = ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID;
	batt_rep_info.dst.short_addr = 0x0000;
	batt_rep_info.dst.endpoint = 1;
	batt_rep_info.dst.profile_id = ZB_AF_HA_PROFILE_ID;
	batt_rep_info.u.send_info.min_interval = RPT_MIN;
	batt_rep_info.u.send_info.max_interval = 0;
	batt_rep_info.u.send_info.delta.u8 = 0x00;
	batt_rep_info.u.send_info.reported_value.u8 = 0;
	batt_rep_info.u.send_info.def_min_interval = RPT_MIN;
	batt_rep_info.u.send_info.def_max_interval = RPT_MAX;
	status = zb_zcl_put_reporting_info(&batt_rep_info, ZB_TRUE);       

	memset(&batt_rep_info, 0, sizeof(batt_rep_info));
	batt_rep_info.direction = ZB_ZCL_CONFIGURE_REPORTING_SEND_REPORT;
	batt_rep_info.ep = SOURCE_ENDPOINT;
	batt_rep_info.cluster_id = ZB_ZCL_CLUSTER_ID_POWER_CONFIG;
	batt_rep_info.cluster_role = ZB_ZCL_CLUSTER_SERVER_ROLE;
	batt_rep_info.attr_id = ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID;
	batt_rep_info.dst.short_addr = 0x0000;
	batt_rep_info.dst.endpoint = 1;
	batt_rep_info.dst.profile_id = ZB_AF_HA_PROFILE_ID;
	batt_rep_info.u.send_info.min_interval = RPT_MIN;
	batt_rep_info.u.send_info.max_interval = RPT_MAX;
	batt_rep_info.u.send_info.delta.u8 = 0x00;
	batt_rep_info.u.send_info.reported_value.u8 = 0;
	batt_rep_info.u.send_info.def_min_interval = RPT_MIN;
	batt_rep_info.u.send_info.def_max_interval = RPT_MAX;
	status = zb_zcl_put_reporting_info(&batt_rep_info, ZB_TRUE);       

	memset(&batt_rep_info, 0, sizeof(batt_rep_info));
	batt_rep_info.direction = ZB_ZCL_CONFIGURE_REPORTING_SEND_REPORT;
	batt_rep_info.ep = SOURCE_ENDPOINT;
	batt_rep_info.cluster_id = ZB_ZCL_CLUSTER_ID_POWER_CONFIG;
	batt_rep_info.cluster_role = ZB_ZCL_CLUSTER_SERVER_ROLE;
	batt_rep_info.attr_id = ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_ALARM_STATE_ID;
	batt_rep_info.dst.short_addr = 0x0000;
	batt_rep_info.dst.endpoint = 1;
	batt_rep_info.dst.profile_id = ZB_AF_HA_PROFILE_ID;
	batt_rep_info.u.send_info.min_interval = RPT_MIN;
	batt_rep_info.u.send_info.max_interval = RPT_MAX;
	batt_rep_info.u.send_info.delta.u8 = 0x00;
	batt_rep_info.u.send_info.reported_value.u32 = 0;
	batt_rep_info.u.send_info.def_min_interval = RPT_MIN;
	batt_rep_info.u.send_info.def_max_interval = RPT_MAX;
	status = zb_zcl_put_reporting_info(&batt_rep_info, ZB_TRUE);       
}


//---------------------------------------------------------------------------------------------
// configure LEDs and buttons
//

static void configure_gpio (void)
{
	int err;

	err = dk_buttons_init (button_handler);
	if (err) {
		LOG_ERR ("Cannot init buttons (err: %d)", err);
	}

	err = dk_leds_init ();
	if (err) {
		LOG_ERR ("Cannot init LEDs (err: %d)", err);
	}

#if DT_NODE_EXISTS(DT_NODELABEL(led0))
	// turn led on until network is joined
	dk_set_led_on (ZIGBEE_NETWORK_STATE_LED); 
#endif

#if DT_NODE_EXISTS(DT_NODELABEL(led1))
	// turn unused user LED off
	dk_set_led_off (USER_LED); 
#endif
}


//---------------------------------------------------------------------------------------------
// set default values of attributes in the application's clusters
//

static void app_clusters_attr_init (void)
{
	// Basic cluster attributes data.
	dev_ctx.basic_attr.zcl_version   = ZB_ZCL_VERSION;
	dev_ctx.basic_attr.power_source  = ZB_ZCL_BASIC_POWER_SOURCE_UNKNOWN;
    dev_ctx.basic_attr.power_source  = FOUR_INPUT_INIT_BASIC_POWER_SOURCE;
    dev_ctx.basic_attr.stack_version = FOUR_INPUT_INIT_BASIC_STACK_VERSION;
    dev_ctx.basic_attr.hw_version    = FOUR_INPUT_INIT_BASIC_HW_VERSION;

    // Use ZB_ZCL_SET_STRING_VAL to set strings, because the first byte should
    // contain string length without trailing zero.
    //
    // For example "test" string wil be encoded as:
    //   [(0x4), 't', 'e', 's', 't']

    ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.mf_name,
                          FOUR_INPUT_INIT_BASIC_MANUF_NAME,
                          ZB_ZCL_STRING_CONST_SIZE(FOUR_INPUT_INIT_BASIC_MANUF_NAME));

    ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.model_id,
                          FOUR_INPUT_INIT_BASIC_MODEL_ID,
                          ZB_ZCL_STRING_CONST_SIZE(FOUR_INPUT_INIT_BASIC_MODEL_ID));

    ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.date_code,
                          FOUR_INPUT_INIT_BASIC_DATE_CODE,
                          ZB_ZCL_STRING_CONST_SIZE(FOUR_INPUT_INIT_BASIC_DATE_CODE));


    ZB_ZCL_SET_STRING_VAL(dev_ctx.basic_attr.location_id,
                          FOUR_INPUT_INIT_BASIC_LOCATION_DESC,
                          ZB_ZCL_STRING_CONST_SIZE(FOUR_INPUT_INIT_BASIC_LOCATION_DESC));


    dev_ctx.basic_attr.ph_env = FOUR_INPUT_INIT_BASIC_PH_ENV;

	// Identify cluster attributes data.
	dev_ctx.identify_attr.identify_time = ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE;

	// Power config attributes data.
	dev_ctx.power_attr.voltage               = ZB_ZCL_POWER_CONFIG_BATTERY_VOLTAGE_INVALID;
	dev_ctx.power_attr.size                  = ZB_ZCL_POWER_CONFIG_BATTERY_SIZE_OTHER;
	dev_ctx.power_attr.quantity              = 1;
	dev_ctx.power_attr.rated_voltage         = 30;
	dev_ctx.power_attr.alarm_mask            = 0x00;
	dev_ctx.power_attr.voltage_min_threshold = 20;
	dev_ctx.power_attr.percent_remaining     = ZB_ZCL_POWER_CONFIG_BATTERY_REMAINING_UNKNOWN;
	dev_ctx.power_attr.voltage_threshold_1   = 22;
	dev_ctx.power_attr.voltage_threshold_2   = 24;
	dev_ctx.power_attr.voltage_threshold_3   = 26;
	dev_ctx.power_attr.percent_min_threshold = 2*10;
	dev_ctx.power_attr.percent_threshold_1   = 2*15;
	dev_ctx.power_attr.percent_threshold_2   = 2*20;
	dev_ctx.power_attr.percent_threshold_3   = 2*25;
	dev_ctx.power_attr.alarm_state           = 0x00000000;
}


//---------------------------------------------------------------------------------------------
// button event handler
//

