bikerglen/homebrew_zigbee_devices/nrf52840-four-input/zigbee_switch_v2/src/main.c
static void button_handler (uint32_t button_state, uint32_t has_changed)
{
	zb_uint16_t cmd_id = 0xFFFF;
	zb_ret_t zb_err_code;

	LOG_INF ("button_handler");

	// inform default signal handler about user input at the device
	user_input_indicate ();

    // check for start of factory reset
	check_factory_reset_button (button_state, has_changed);

	// check button 0 to 3 pressed, button 4 released
	if (BUTTON_0 & has_changed & button_state) {
		// button 0 pressed: send off command (0)
		cmd_id = ZB_ZCL_CMD_ON_OFF_OFF_ID;
	} else if (BUTTON_1 & has_changed & button_state) {
		// button 1 pressed: send on command (1)
		cmd_id = ZB_ZCL_CMD_ON_OFF_ON_ID;
		// dk_set_led_on (USER_LED); 
	} else if (BUTTON_2 & has_changed & button_state) {
		// button 2 pressed: send toggle command (2)
		cmd_id = ZB_ZCL_CMD_ON_OFF_TOGGLE_ID;
	} else if (BUTTON_3 & has_changed & button_state) {
		// button 3 pressed: send a reserved command (3)
		cmd_id = 3;
	} else if (BUTTON_4 & has_changed & ~button_state) {
		// button 4 released: if not factory reset, enter identify mode
		if (!was_factory_reset_done ()) {
			// Button released before Factory Reset, Start identification mode
			ZB_SCHEDULE_APP_CALLBACK (start_identifying, 0);
		}
#ifdef ENABLE_BUTTON_RELEASE_REPORTS
	} else if (BUTTON_0 & has_changed & ~button_state) {
		cmd_id = 4;
	} else if (BUTTON_1 & has_changed & ~button_state) {
		cmd_id = 5;
		// dk_set_led_off (USER_LED); 
	} else if (BUTTON_2 & has_changed & ~button_state) {
		cmd_id = 6;
	} else if (BUTTON_3 & has_changed & ~button_state) {
		cmd_id = 7;
#endif
	}

	// if needed, send a command
	if (cmd_id != 0xFFFF) {
		zb_err_code = zb_buf_get_out_delayed_ext (light_switch_send_on_off, cmd_id, 0);
		ZB_ERROR_CHECK (zb_err_code);
	}
}


//---------------------------------------------------------------------------------------------
// send light switch on off command
//
// bufid    Non-zero reference to Zigbee stack buffer that will be used to construct on/off request.
// cmd_id   ZCL command id.
//

static void light_switch_send_on_off (zb_bufid_t bufid, zb_uint16_t cmd_id)
{
	LOG_INF("Send ON/OFF command: %d", cmd_id);

	ZB_ZCL_ON_OFF_SEND_REQ(bufid,
			       dest_ctx.short_addr,
			       ZB_APS_ADDR_MODE_16_ENDP_PRESENT,
			       dest_ctx.endpoint,
			       SOURCE_ENDPOINT,
			       ZB_AF_HA_PROFILE_ID,
			       ZB_ZCL_DISABLE_DEFAULT_RESPONSE,
			       cmd_id,
			       NULL);
}


//---------------------------------------------------------------------------------------------
// start identifying
//

static void start_identifying (zb_bufid_t bufid)
{
	ZVUNUSED(bufid);

	if (ZB_JOINED()) {
		// Check if endpoint is in identifying mode,
		// if not, put desired endpoint in identifying mode.
		if (dev_ctx.identify_attr.identify_time ==
		    ZB_ZCL_IDENTIFY_IDENTIFY_TIME_DEFAULT_VALUE) {

			zb_ret_t zb_err_code = zb_bdb_finding_binding_target(SOURCE_ENDPOINT);

			if (zb_err_code == RET_OK) {
				LOG_INF("Enter identify mode");
			} else if (zb_err_code == RET_INVALID_STATE) {
				LOG_WRN("RET_INVALID_STATE - Cannot enter identify mode");
			} else {
				ZB_ERROR_CHECK(zb_err_code);
			}
		} else {
			LOG_INF("Cancel identify mode");
			zb_bdb_finding_binding_target_cancel();
		}
	} else {
		LOG_WRN("Device not in a network - cannot enter identify mode");
	}
}


//---------------------------------------------------------------------------------------------
// identify callback
// 

static void identify_cb (zb_bufid_t bufid)
{
	zb_ret_t zb_err_code;

	if (bufid) {
		/* Schedule a self-scheduling function that will toggle the LED. */
		ZB_SCHEDULE_APP_CALLBACK(toggle_identify_led, bufid);
	} else {
		/* Cancel the toggling function alarm and turn off LED. */
		zb_err_code = ZB_SCHEDULE_APP_ALARM_CANCEL(toggle_identify_led, ZB_ALARM_ANY_PARAM);
		ZVUNUSED(zb_err_code);

		/* Update network status/idenitfication LED. */
		if (ZB_JOINED()) {
			dk_set_led_off(ZIGBEE_NETWORK_STATE_LED);
		} else {
			dk_set_led_on(ZIGBEE_NETWORK_STATE_LED);
		}
	}
}


//---------------------------------------------------------------------------------------------
// toggle identify led
//

static void toggle_identify_led (zb_bufid_t bufid)
{
	static int blink_status;

	dk_set_led(ZIGBEE_NETWORK_STATE_LED, (++blink_status) % 2);
	ZB_SCHEDULE_APP_ALARM(toggle_identify_led, bufid, ZB_MILLISECONDS_TO_BEACON_INTERVAL(100));
}


//---------------------------------------------------------------------------------------------
// bit-banged spi to place spi flash on some sparkfun boards into the power down state
//

#if DT_NODE_EXISTS(DT_NODELABEL(sw_spi_cs_n))

static void power_down_spi_flash (void)
{
	const struct gpio_dt_spec spi_cs_n = GPIO_DT_SPEC_GET(DT_NODELABEL(sw_spi_cs_n),gpios);
	const struct gpio_dt_spec spi_sck = GPIO_DT_SPEC_GET(DT_NODELABEL(sw_spi_sck),gpios);
	const struct gpio_dt_spec spi_mosi = GPIO_DT_SPEC_GET(DT_NODELABEL(sw_spi_mosi),gpios);
	const struct gpio_dt_spec spi_wr_n = GPIO_DT_SPEC_GET(DT_NODELABEL(sw_spi_wr_n),gpios);
	const struct gpio_dt_spec spi_hold_n = GPIO_DT_SPEC_GET(DT_NODELABEL(sw_spi_hold_n),gpios);

	gpio_pin_configure_dt (&spi_cs_n, GPIO_OUTPUT | GPIO_ACTIVE_HIGH | GPIO_PUSH_PULL);
	gpio_pin_configure_dt (&spi_sck, GPIO_OUTPUT | GPIO_ACTIVE_HIGH | GPIO_PUSH_PULL);
	gpio_pin_configure_dt (&spi_mosi, GPIO_OUTPUT | GPIO_ACTIVE_HIGH | GPIO_PUSH_PULL);
	gpio_pin_configure_dt (&spi_wr_n, GPIO_OUTPUT | GPIO_ACTIVE_HIGH | GPIO_PUSH_PULL);
	gpio_pin_configure_dt (&spi_hold_n, GPIO_OUTPUT | GPIO_ACTIVE_HIGH | GPIO_PUSH_PULL);
	gpio_pin_set_dt (&spi_cs_n, 1);
	gpio_pin_set_dt (&spi_sck, 0);
	gpio_pin_set_dt (&spi_mosi, 0);
	gpio_pin_set_dt (&spi_wr_n, 1);
	gpio_pin_set_dt (&spi_hold_n, 1);	

	k_sleep(K_MSEC(1));

	gpio_pin_set_dt (&spi_cs_n, 0);
	k_sleep(K_USEC(1));

	uint8_t data = 0xb9;
	for (int i = 0; i < 8; i++) {
		gpio_pin_set_dt (&spi_mosi, (data & 0x80) ? 1 : 0);
		data <<= 1;
		k_sleep(K_USEC(1));
		gpio_pin_set_dt (&spi_sck, 1);
		k_sleep(K_USEC(1));
		gpio_pin_set_dt (&spi_sck, 0);
		k_sleep(K_USEC(1));
	}

	k_sleep(K_USEC(1));
	gpio_pin_set_dt (&spi_cs_n, 1);
}

#endif


//---------------------------------------------------------------------------------------------
// use the adc to periodically read the battery voltage on vdd pin and update the 
// battery voltage attribute. if joined to a network, send the attribute report.
// using the old nrfx saadc driver because it permits the adc to be shutdown between
// samples. the zypher saadc driver does not have this capability.
//

#define NRFX_SAADC_CONFIG_IRQ_PRIORITY 6

static void read_battery_voltage_cb (struct k_timer *timer)
{
	// we're in an interrupt but need to complete the work outside of an interrupt
    k_work_submit (&read_battery_voltage_work);
}


static void read_battery_voltage_work_handler(struct k_work *work)
{
	static int report_count = 0;
	nrfx_err_t status;
	nrfx_saadc_channel_t channel;
	nrf_saadc_value_t sample;
	zb_zcl_reporting_info_t *info;

	LOG_INF ("===== read_battery_voltage_work_handler (%d) =====", report_count++);
	// LOG_INF ("zb_osif_is_inside_isr: %d", zb_osif_is_inside_isr());

	// initialize adc
	status = nrfx_saadc_init (NRFX_SAADC_CONFIG_IRQ_PRIORITY);

