bikerglen/homebrew_zigbee_devices/nrf52840-four-input/zigbee_switch_v2/src/main.c
	channel.channel_config.resistor_p = NRF_SAADC_RESISTOR_DISABLED;
	channel.channel_config.resistor_n = NRF_SAADC_RESISTOR_DISABLED;
	channel.channel_config.gain       = NRF_SAADC_GAIN1_6;
	channel.channel_config.reference  = NRF_SAADC_REFERENCE_INTERNAL;
	channel.channel_config.acq_time   = NRFX_SAADC_DEFAULT_ACQTIME;
	channel.channel_config.mode       = NRF_SAADC_MODE_SINGLE_ENDED;
	channel.channel_config.burst      = NRF_SAADC_BURST_DISABLED;
	channel.pin_p                     = NRF_SAADC_INPUT_VDD;
	channel.pin_n                     = NRF_SAADC_INPUT_DISABLED;
	channel.channel_index             = 0;

    status = nrfx_saadc_channel_config (&channel);

	status = nrfx_saadc_simple_mode_set ((1<<0),
                                         NRF_SAADC_RESOLUTION_14BIT,
                                         NRF_SAADC_OVERSAMPLE_8X,
                                         NULL);
        
    status = nrfx_saadc_buffer_set (&sample, 1);

	// read sample
    status = nrfx_saadc_mode_trigger ();

	// shutdown adc to save power
	nrfx_saadc_uninit ();

	// convert to millivolts
	int32_t resolution = 14;
	int32_t gainrecip = 6;
	int32_t ref_mv = 600;
	int32_t adc_mv = (sample * ref_mv * gainrecip) >> resolution;

	// convert to 100s of millivolts
	zb_uint8_t battery_voltage = (adc_mv + 50) / 100;

	// convert to percentage remaining
	zb_uint8_t battery_level = cr2032_CalculateLevel (adc_mv);

	LOG_INF ("adc: %04x / %d mV / %d / %d%%", sample, adc_mv, battery_voltage, battery_level / 2);

	// update battery voltage attribute value
    zb_zcl_set_attr_val (SOURCE_ENDPOINT,
                         ZB_ZCL_CLUSTER_ID_POWER_CONFIG, 
                         ZB_ZCL_CLUSTER_SERVER_ROLE, 
                         ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID,
                         &battery_voltage, 
                         ZB_FALSE);

	// mark battery voltage attribute for reporting
	// technically, this attribute is not reportable so we force it here
	zb_zcl_mark_attr_for_reporting (SOURCE_ENDPOINT,
	                                ZB_ZCL_CLUSTER_ID_POWER_CONFIG,
									ZB_ZCL_CLUSTER_SERVER_ROLE,
									ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_VOLTAGE_ID);

	// update percentage remaining attribute value
	// this attribute is reportable so set attr will call mark_attr for us.
    zb_zcl_set_attr_val (SOURCE_ENDPOINT,
                         ZB_ZCL_CLUSTER_ID_POWER_CONFIG, 
                         ZB_ZCL_CLUSTER_SERVER_ROLE, 
                         ZB_ZCL_ATTR_POWER_CONFIG_BATTERY_PERCENTAGE_REMAINING_ID,
                         &battery_level, 
                         ZB_FALSE);

	zb_buf_get_out_delayed_ext (send_attribute_report, 0, 0);

	if (report_count < 10) {
		for (int i = 0; i < ZB_FOUR_INPUT_REPORT_ATTR_COUNT; i++) {
			info = zb_zcl_get_reporting_info(i);
			if (info != NULL) {
				LOG_INF ("dir: %d ep: %d cluster: %d role: %d attr: %d flags: 0x%x run time: %d dst: %04x, dep: %d, prof: %d, mini: %d, maxi: %d", 
					info->direction,
					info->ep,
					info->cluster_id,
					info->cluster_role,
					info->attr_id,
					info->flags,
					info->run_time,
					info->dst.short_addr,
					info->dst.endpoint,
					info->dst.profile_id,
					info->u.send_info.min_interval,
					info->u.send_info.max_interval
				);
			}
		}
	}	
}


static void send_attribute_report (zb_bufid_t bufid, zb_uint16_t cmd_id)
{
	LOG_INF("force zboss scheduler to wake and send attribute report");
    zb_buf_free (bufid);
}


// from thunderboard react
uint8_t cr2032_CalculateLevel (uint16_t voltage)
{
  uint32_t res = 0;
  uint8_t i;

  // Iterate through voltage/capacity table until correct interval is found.
  // Then interpolate capacity within that interval based on a linear approximation
  // between the capacity at the low and high end of the interval.
  for (i = 0; i < (sizeof(vcPairs) / sizeof(voltage_capacity_pair_t)); i++) {
    if (voltage > vcPairs[i].voltage) {
      if (i == 0) {
        // Higher than maximum voltage in table.
        return vcPairs[0].capacity;
      } else {
        // Calculate the capacity by interpolation.
        res = (voltage - vcPairs[i].voltage)
              * (vcPairs[i - 1].capacity - vcPairs[i].capacity)
              / (vcPairs[i - 1].voltage - vcPairs[i].voltage);
        res += vcPairs[i].capacity;
        return (uint8_t)res;
      }
    }
  }
  // Below the minimum voltage in the table.
  return vcPairs[sizeof(vcPairs) / sizeof(voltage_capacity_pair_t) - 1].capacity;
}
